open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_mailbox_channel.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * BK7258 Mailbox V2 logical transport.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdint.h>
#include <syslog.h>
#include <string.h>

#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kthread.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>

#include "bk7258_driver.h"
#include "bk7258_netstats.h"
#include "hardware/bk7258_mbox.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define MB_CHANNEL_COUNT       7u
#define MB_RX_CHANNEL_COUNT    6u
#define MB_ACK_SLOT_COUNT      8u
#define MB_ACK_HIGH_WATER      3u
#define MB_TIMEOUT             MSEC2TICK(200)
#define MB_WORK_INTERVAL       MSEC2TICK(10)
#define MB_PROBE_MAX_ATTEMPTS  3u
#define MB_RECOVERY_SLOT_COUNT 4u
#define MB_DOWN_RETRY          MSEC2TICK(100)
#define MB_TX_PRIORITY         105

/* The CP waits for this AP boot notification before it marks CPU1 ready.
 * It must be allowed through while the normal UART/mailbox link is still
 * probing; otherwise board_late_initialize() and the CP wait on each other.
 */
#define MB_PWC_CPU1_BOOT_READY 0x05u

/* Consecutive UART0_TX failures before the link is treated as broken rather
 * than busy.  See handle_ack() for why a single one must not count.
 */

#define MB_UART_TX_FAIL_ABORT  4u

/* The CP's flash operation notification (its flash_notify.c): the header
 * command carries the edge, param1 the request/acknowledge state.  Values
 * come from the IPC_FLASH_OP_* enumerations there and cross cores, so they
 * are fixed by that side.
 */

#define FLASH_OP_START         0u
#define FLASH_OP_END           1u
#define FLASH_OP_STATE_REQ     1u
#define FLASH_OP_STATE_ACK     2u

enum ack_slot_state
{
  ACK_SLOT_FREE = 0,
  ACK_SLOT_QUEUED,
  ACK_SLOT_SENT
};

struct logical_channel
{
  struct bk7258_mb_wire_message pending;
  bk7258_mb_tx_complete_t callback;
  void *arg;
  int result;
  bool queued;
};

struct active_transaction
{
  struct bk7258_mb_wire_message message __attribute__((aligned(32)));
  bk7258_mb_tx_complete_t callback;
  void *arg;
  clock_t started;
  uint32_t order;
  uint8_t channel_index;
  bool busy;
  bool quarantine;
};

struct ack_slot
{
  struct bk7258_mb_wire_message message __attribute__((aligned(32)));
  uint32_t order;
  enum ack_slot_state state;
};

struct recovery_epoch
{
  struct bk7258_mb_wire_message reset __attribute__((aligned(32)));
  struct active_transaction probe;
  uint32_t reset_order;
  uint32_t first_probe_order;
  bool reset_sent;
  bool replay;
};

struct transport_stats
{
  uint32_t tx;
  uint32_t rx;
  uint32_t fifo_full;
  uint32_t timeout;
  uint32_t bad_ack;
  uint32_t bad_header;
  uint32_t unsupported;
  uint32_t ack_overflow;
  uint32_t resets;
  uint32_t probes;
  uint32_t probe_fail;
  uint32_t recovery_cycle;
  uint32_t recovery_replay;
  uint32_t link_ready;
  uint32_t link_down;
  uint32_t deferred_command;
  uint32_t bad_ack_reason;
  uint32_t last_ack_header;
  uint32_t last_active_header;
  uint32_t last_command_header;
  uint32_t last_tx_error;
};

static const uint8_t g_channel_ids[MB_CHANNEL_COUNT] =
{
  BK7258_MB_CHAN_HW_CTRL_TX,
  BK7258_MB_CHAN_IPC_TX,
  BK7258_MB_CHAN_PWC_TX,
  BK7258_MB_CHAN_BT_TX,
  BK7258_MB_CHAN_WIFI_CMD_TX,
  BK7258_MB_CHAN_WIFI_DATA_TX,
  BK7258_MB_CHAN_UART0_TX
};

static const uint8_t g_rx_channel_ids[MB_RX_CHANNEL_COUNT] =
{
  BK7258_MB_CHAN_IPC_RX,
  BK7258_MB_CHAN_BT_RX,
  BK7258_MB_CHAN_WIFI_CMD_RX,
  BK7258_MB_CHAN_WIFI_DATA_RX,
  BK7258_MB_CHAN_UART0_RX,
  BK7258_MB_CHAN_SARADC_RX
};

static struct logical_channel g_channels[MB_CHANNEL_COUNT];
static struct active_transaction g_active;
static struct recovery_epoch g_recovery[MB_RECOVERY_SLOT_COUNT];
static struct ack_slot g_ack_slots[MB_ACK_SLOT_COUNT];

static struct transport_stats g_stats;
static bk7258_mb_channel_rx_t g_rx_callbacks[MB_RX_CHANNEL_COUNT];
static void *g_rx_args[MB_RX_CHANNEL_COUNT];
static int (*g_pwc_rx)(const void *message);
static bk7258_mb_link_callback_t g_link_callback;
static void *g_link_arg;
static sem_t g_tx_sem;
static sem_t g_diag_sem;
static uint32_t g_send_order;
static uint8_t g_tx_seq;
static enum bk7258_mb_link_state g_link_state;
static bool g_initialized;
static bool g_physical_started;
static bool g_state_initialized;
static bool g_tx_worker_created;
static bool g_diag_worker_created;
static bool g_reset_pending;
static bool g_probe_requested;
static uint8_t g_probe_attempts;
static uint8_t g_recovery_index;

/* Consecutive UART0_TX failures, and where the next dispatch scan starts
 * among
 * the channels that take turns.  Both are explained where they are used:
 * complete_active() and dispatch_locked().
 */

static uint8_t g_uart_tx_failures;
static uint8_t g_dispatch_rotor;
static clock_t g_down_since;
static enum bk7258_mb_link_state g_diag_state;
static uint32_t g_peer_reset_generation;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool
is_boot_ready_message(uint8_t logical_channel,
                      const struct bk7258_mb_wire_message *message)
{
  return logical_channel == BK7258_MB_CHAN_PWC_TX &&
         bk7258_mb_header_cmd(message) == MB_PWC_CPU1_BOOT_READY;
}

  /* HW_CTRL power-up and heartbeat indications provide the CP-side readiness
   * signal for the AP console. They must be allowed while the UART channel
   * is
   * still probing, otherwise startup waits on a circular dependency.
   */

static bool is_boot_ipc_message(uint8_t logical_channel,
                                const struct bk7258_mb_wire_message *message)
{
  return logical_channel == BK7258_MB_CHAN_HW_CTRL_TX &&
         (bk7258_mb_header_cmd(message) == 1u ||
          bk7258_mb_header_cmd(message) == 2u);
}

rspinlock_t g_bk7258_driver_lock = RSPINLOCK_INITIALIZER;

static_assert(MB_ACK_SLOT_COUNT >= 2u * 3u + 1u,
               "ACK pool must exceed two hardware FIFO depths");
static_assert(MB_RECOVERY_SLOT_COUNT >= 3u,
               "at least three stable recovery epochs are required");

static struct recovery_epoch *current_recovery(void)
{
  return &g_recovery[g_recovery_index];
}

