open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
static unsigned int channel_index(uint8_t channel)
{
  unsigned int i;

  for (i = 0; i < MB_CHANNEL_COUNT; i++)
    {
      if (g_channel_ids[i] == channel)
        {
          return i;
        }
    }

  return MB_CHANNEL_COUNT;
}

static unsigned int rx_channel_index(uint8_t channel)
{
  unsigned int i;

  for (i = 0; i < MB_RX_CHANNEL_COUNT; i++)
    {
      if (g_rx_channel_ids[i] == channel)
        {
          return i;
        }
    }

  return MB_RX_CHANNEL_COUNT;
}

static unsigned int ack_slots_used(void)
{
  unsigned int count = 0;
  unsigned int i;

  for (i = 0; i < MB_ACK_SLOT_COUNT; i++)
    {
      if (g_ack_slots[i].state != ACK_SLOT_FREE)
        {
          count++;
        }
    }

  return count;
}

static struct active_transaction *busy_probe(void)
{
  unsigned int i;

  for (i = 0; i < MB_RECOVERY_SLOT_COUNT; i++)
    {
      if (g_recovery[i].probe.busy)
        {
          return &g_recovery[i].probe;
        }
    }

  return NULL;
}

static int send_slot(struct bk7258_mb_wire_message *message,
                     uint32_t *order)
{
  uint32_t wire[2];
  int ret;

  *order = ++g_send_order;
  wire[0] = (uint32_t)(uintptr_t)message;
  wire[1] = sizeof(*message);
  __asm__ volatile("dmb sy" ::: "memory");
  ret = bk7258_mbox_send(0, wire);
  if (ret == OK)
    {
      g_stats.tx++;
    }
  else if (ret == -EAGAIN)
    {
      g_stats.fifo_full++;
    }

  if (ret < 0)
    {
      g_stats.last_tx_error = (uint32_t)(-ret);
    }

  return ret;
}

static void release_acks_before(uint32_t order)
{
  unsigned int i;

  for (i = 0; i < MB_ACK_SLOT_COUNT; i++)
    {
      if (g_ack_slots[i].state == ACK_SLOT_SENT &&
          g_ack_slots[i].order < order)
        {
          g_ack_slots[i].state = ACK_SLOT_FREE;
        }
    }
}

static void set_link_state(enum bk7258_mb_link_state state)
{
  if (g_link_state != state)
    {
      if (state == BK7258_MB_LINK_READY)
        {
          g_stats.link_ready++;
        }
      else if (state == BK7258_MB_LINK_DOWN)
        {
          g_stats.link_down++;
          g_down_since = clock_systime_ticks();
        }

      g_link_state = state;
      nxsem_post(&g_tx_sem);
      g_diag_state = state;
      nxsem_post(&g_diag_sem);
    }
}

static void complete_transaction(struct active_transaction *active,
                                 const struct bk7258_mb_wire_message *ack,
                                 int result)
{
  struct logical_channel *channel = NULL;

  if (active->channel_index < MB_CHANNEL_COUNT)
    {
      channel = &g_channels[active->channel_index];
      channel->queued = false;
      channel->result = result;
    }

  active->busy = false;
  if (result == OK)
    {
      release_acks_before(active->order);
    }

  if (active->callback != NULL)
    {
      active->callback(ack, result, active->arg);
    }
}

static void fail_pending(int result)
{
  unsigned int i;

  for (i = 0; i < MB_CHANNEL_COUNT; i++)
    {
      struct logical_channel *channel = &g_channels[i];

      if (channel->queued)
        {
          channel->queued = false;
          channel->result = result;
          if (channel->callback != NULL)
            {
              channel->callback(NULL, result, channel->arg);
            }
        }
    }
}

static void release_recovery_slots(void)
{
  unsigned int i;

  g_active.quarantine = false;
  for (i = 0; i < MB_RECOVERY_SLOT_COUNT; i++)
    {
      memset(&g_recovery[i], 0, sizeof(g_recovery[i]));
    }
}

static void select_recovery_epoch(void)
{
  unsigned int i;
  struct recovery_epoch *epoch = NULL;

  for (i = 0; i < MB_RECOVERY_SLOT_COUNT; i++)
    {
      if (!g_recovery[i].probe.quarantine &&
          !g_recovery[i].reset_sent && !g_recovery[i].probe.busy)
        {
          epoch = &g_recovery[i];
          g_recovery_index = i;
          break;
        }
    }

  if (epoch == NULL)
    {
      uint32_t newest = 0;

      for (i = 0; i < MB_RECOVERY_SLOT_COUNT; i++)
        {
          if (g_recovery[i].probe.order >= newest)
            {
              newest = g_recovery[i].probe.order;
              epoch = &g_recovery[i];
              g_recovery_index = i;
            }
        }

      epoch->replay = true;
      g_stats.recovery_replay++;
    }
  else
    {
      memset(epoch, 0, sizeof(*epoch));
      epoch->reset.header = bk7258_mb_make_header(
        0, 0, BK7258_MB_CTRL_ACK_BOX | BK7258_MB_CTRL_RESET, 0,
        BK7258_MB_CHAN_HW_CTRL_TX);
    }

  g_probe_attempts = 0;
  g_reset_pending = !epoch->replay;
  g_stats.recovery_cycle++;
  set_link_state(epoch->replay ? BK7258_MB_LINK_PROBING :
                                 BK7258_MB_LINK_ABORTING);
}

static void begin_abort(int result)
{
  struct active_transaction *probe = busy_probe();

  if (g_active.busy)
    {
      g_active.quarantine = true;
      complete_transaction(&g_active, NULL, result);
    }

  if (probe != NULL)
    {
      probe->quarantine = true;
      complete_transaction(probe, NULL, result);
    }

  fail_pending(result);
  g_probe_requested = false;
  select_recovery_epoch();
}

static struct ack_slot *alloc_ack_slot(void)
{
  unsigned int i;

  for (i = 0; i < MB_ACK_SLOT_COUNT; i++)
    {
      if (g_ack_slots[i].state == ACK_SLOT_FREE)
        {
          g_ack_slots[i].state = ACK_SLOT_QUEUED;
          return &g_ack_slots[i];
        }
    }

  g_stats.ack_overflow++;
  return NULL;
}

static int dispatch_locked(void)
{
  struct recovery_epoch *epoch = current_recovery();
  struct active_transaction *active;
  struct logical_channel *channel;
  unsigned int i;
  unsigned int n;
  int ret;

  /* ACKs always outrank RESET and ordinary commands. */

  for (i = 0; i < MB_ACK_SLOT_COUNT; i++)
    {
      if (g_ack_slots[i].state != ACK_SLOT_QUEUED)
        {
          continue;
        }

      ret = send_slot(&g_ack_slots[i].message, &g_ack_slots[i].order);
      if (ret < 0)
        {
          return ret;
        }

      g_ack_slots[i].state = ACK_SLOT_SENT;
    }

  if (g_reset_pending)
    {
      ret = send_slot(&epoch->reset, &epoch->reset_order);
      if (ret < 0)
        {
          return ret;
        }

