open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
      g_reset_pending = false;
      epoch->reset_sent = true;
      set_link_state(BK7258_MB_LINK_PROBING);
    }

  if (g_active.busy || busy_probe() != NULL)
    {
      return OK;
    }

  /* One transaction is in flight at a time, so the order this loop visits
   * channels in is a priority order, and a strict scan from 0 makes it a
   * starvation order too: whatever sits at a lower index and always has
   * something queued keeps everything below it off the link indefinitely.
   *
   * That is not hypothetical.  WIFI_DATA_TX is index 5 and UART0_TX is index
   * 6, so any sustained upload -- social mode is the first workload that
   * produces one -- stops the console from ever being dispatched.  Starved
   * past MB_TIMEOUT it fails, and handle_ack() used to answer that by
   * aborting the link, which stops the heartbeat, which resets the part.
   *
   * Index 0 keeps absolute precedence because that is HW_CTRL_TX, the
   * heartbeat: it is answering an 8 s deadline and is one small frame every
   * 2 s, so it costs the others nothing to always let it go first.  The rest
   * take turns, which bounds how long any of them can be held off by the
   * others rather than leaving it open-ended.
   *
   * Rotating is not enough on its own -- see handle_ack(), which is where a
   * starved console frame turned into a link abort.
   */

  for (n = 0; n < MB_CHANNEL_COUNT; n++)
    {
      i = n == 0 ? 0 :
          1u + (g_dispatch_rotor + (n - 1u)) % (MB_CHANNEL_COUNT - 1u);

      channel = &g_channels[i];
      if (!channel->queued)
        {
          continue;
        }

      if (g_link_state == BK7258_MB_LINK_PROBING)
        {
          if (g_channel_ids[i] == BK7258_MB_CHAN_UART0_TX &&
              bk7258_mb_header_cmd(&channel->pending) ==
              BK7258_MB_UART_STATE)
            {
              active = &epoch->probe;
            }
          else if (is_boot_ready_message(g_channel_ids[i],
                                         &channel->pending) ||
                   is_boot_ipc_message(g_channel_ids[i],
                                       &channel->pending))
            {
              /* CPU1 boot-ready is the one PWC frame that must be sent
               * before the ordinary link reaches READY.
               */

              active = &g_active;
            }
          else
            {
              continue;
            }

          if (active == &epoch->probe && active->quarantine &&
              !epoch->replay)
            {
              return -ENOLINK;
            }
        }
      else if (g_link_state == BK7258_MB_LINK_READY)
        {
          active = &g_active;
          if (active->quarantine)
            {
              return -ENOLINK;
            }
        }
      else
        {
          return OK;
        }

      if (!epoch->replay || active != &epoch->probe)
        {
          memset(&active->message, 0, sizeof(active->message));
          memcpy(&active->message, &channel->pending,
                 sizeof(active->message));
          active->message.header = bk7258_mb_make_header(
            bk7258_mb_header_cmd(&channel->pending),
            bk7258_mb_header_state(&channel->pending), 0, ++g_tx_seq,
            g_channel_ids[i]);
        }

      active->callback = channel->callback;
      active->arg = channel->arg;
      active->channel_index = i;
      active->started = clock_systime_ticks();
      active->busy = true;
      ret = send_slot(&active->message, &active->order);
      if (ret < 0)
        {
          active->busy = false;
          return ret;
        }

      if (active == &epoch->probe)
        {
          if (epoch->first_probe_order == 0)
            {
              epoch->first_probe_order = active->order;
            }

          g_probe_attempts++;
          g_stats.probes++;
        }

      /* Hand the turn to the next channel, so the one that just sent goes to
       * the back of the queue instead of winning again.  Index 0 is outside
       * the rotation and does not move it: the heartbeat keeps its
       * precedence
       * without consuming anyone else's turn.
       */

      if (i != 0)
        {
          g_dispatch_rotor = (uint8_t)(i % (MB_CHANNEL_COUNT - 1u));
        }

      return OK;
    }

  return OK;
}

static uint32_t ack_header_reason(
  const struct bk7258_mb_wire_message *message,
  const struct active_transaction *active)
{
  uint8_t control = bk7258_mb_header_ctrl(message);
  uint32_t reason = 0;

  if (!active->busy)
    {
      return 1u;
    }

  if (control != BK7258_MB_CTRL_ACK_BOX)
    {
      reason |= 2u;
    }

  if (bk7258_mb_header_channel(message) !=
      bk7258_mb_header_channel(&active->message))
    {
      reason |= 4u;
    }

  if (bk7258_mb_header_seq(message) !=
      bk7258_mb_header_seq(&active->message))
    {
      reason |= 8u;
    }

  if (bk7258_mb_header_cmd(message) !=
      bk7258_mb_header_cmd(&active->message))
    {
      reason |= 16u;
    }

  return reason;
}

static bool valid_uart_ack(const struct bk7258_mb_wire_message *message)
{
  /* Armino reuses the transmitted UART command buffer as its response.  It
   * overwrites only the low byte of ack_data1 with uart_rts/uart_tx_fail;
   * payload_address, length, flags and the trailing words therefore retain
   * request data.  Header matching is the ownership check for this ACK.
   */

  return message != NULL;
}

static void handle_ack(const struct bk7258_mb_wire_message *message)
{
  struct recovery_epoch *epoch = current_recovery();
  struct active_transaction *active;
  bool replay;
  int result;
  uint32_t reason;

  active = busy_probe();
  if (active == NULL)
    {
      active = &g_active;
    }

  g_stats.last_ack_header = message->header;
  g_stats.last_active_header = active->message.header;
  reason = ack_header_reason(message, active);
  if (reason != 0)
    {
      g_stats.bad_ack++;
      g_stats.bad_ack_reason |= reason;
      return;
    }

  if (bk7258_mb_header_channel(message) == BK7258_MB_CHAN_UART0_TX &&
      !valid_uart_ack(message))
    {
      /* Keep active stable.  A malformed ACK is not an ownership proof. */

