open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
      g_stats.bad_ack++;
      g_stats.bad_ack_reason |= 32u;
      return;
    }

  if ((bk7258_mb_header_state(message) & ~BK7258_MB_STATE_COM_FAIL) != 0)
    {
      g_stats.bad_ack++;
      g_stats.bad_ack_reason |= 64u;
      return;
    }

  result =
    (bk7258_mb_header_state(message) & BK7258_MB_STATE_COM_FAIL) != 0 ?
    -EREMOTEIO : OK;

  if (bk7258_mb_header_channel(message) == BK7258_MB_CHAN_UART0_TX &&
      result == OK && (message->payload_address & 2u) != 0)
    {
      result = -EREMOTEIO;
    }

  replay = active == &epoch->probe && epoch->replay;
  release_acks_before(replay ? epoch->first_probe_order : active->order);
  if (replay)
    {
      unsigned int replay_index = g_recovery_index;
      unsigned int i;

      /* This ACK may be a late ACK for the original copy.  It proves every
       * older epoch was copied, but not that the new replay envelope was
       * copied.  Preserve the replay epoch, free only older epochs, and use
       * one of them for a fresh-sequence confirmation probe.
       */

      complete_transaction(active, message, -EAGAIN);
      g_active.quarantine = false;
      for (i = 0; i < MB_RECOVERY_SLOT_COUNT; i++)
        {
          if (i != replay_index)
            {
              memset(&g_recovery[i], 0, sizeof(g_recovery[i]));
            }
        }

      select_recovery_epoch();
      (void)dispatch_locked();
      return;
    }

  complete_transaction(active, message, result);

  if (active == &epoch->probe)
    {
      if (result == OK && (message->flags & 2u) == 0)
        {
          release_recovery_slots();
          g_recovery_index = 0;
          g_probe_attempts = 0;
          set_link_state(BK7258_MB_LINK_READY);
        }
      else if (result == -EREMOTEIO &&
               g_probe_attempts < MB_PROBE_MAX_ATTEMPTS)
        {
          /* CP may not have opened MB_UART0 yet.  The matched ACK proves
           * that this probe slot is no longer referenced by its FIFO.
           */
        }
      else
        {
          g_stats.probe_fail++;
          epoch->probe.quarantine = result == -ETIMEDOUT;
          set_link_state(BK7258_MB_LINK_DOWN);
        }
    }

  else if (bk7258_mb_header_channel(message) == BK7258_MB_CHAN_UART0_TX)
    {
      /* One unanswered console frame is not evidence of a broken link, for
       * the
       * same reason an ordinary message is not (see mailbox_tx_worker): the
       * heartbeat and everything else were working up to that moment, and a
       * recovery is what would destroy them.  begin_abort() here puts the
       * link
       * into PROBING, and while it is there bk7258_mailbox_send_wire()
       * refuses
       * every heartbeat -- so the CP resets the part unless recovery
       * finishes
       * inside its 8 s budget, which nothing here guarantees.
       *
       * Measured 2026-08-31: entering social mode starts sustained uploads,
       * UART0_TX is last in the dispatch order and starved past MB_TIMEOUT,
       * and this line turned that into "IPC[1]heartbeat timeout" and a
       * reboot
       * loop with the AP running normally throughout.  The dispatch rotation
       * below is the other half of that fix; this half makes a console frame
       * that is merely late cost a log line instead of the chip.
       *
       * A link that really is down fails these consecutively, which is what
       * the threshold distinguishes.  At MB_TIMEOUT per failure it takes
       * ~800 ms to decide, an order of magnitude inside the CP's budget.
       */

      if (result >= 0)
        {
          g_uart_tx_failures = 0;
        }
      else if (++g_uart_tx_failures >= MB_UART_TX_FAIL_ABORT)
        {
          g_uart_tx_failures = 0;
          begin_abort(result);
        }
    }

  (void)dispatch_locked();
}

static int handle_command(const struct bk7258_mb_wire_message *message)
{
  struct ack_slot *slot;
  unsigned int rx_index;
  uint8_t channel = bk7258_mb_header_channel(message);
  uint8_t control = bk7258_mb_header_ctrl(message);
  uint8_t ack_flags = 0;
  uint8_t state = 0;
  int ret = -ENOSYS;

  g_stats.last_command_header = message->header;

  if ((control & BK7258_MB_CTRL_SYNC_TX) == 0)
    {
      slot = alloc_ack_slot();
      if (slot == NULL)
        {
          g_stats.deferred_command++;
          return -EAGAIN;
        }
    }
  else
    {
      slot = NULL;
    }

  if ((control & ~(BK7258_MB_CTRL_SYNC_TX | BK7258_MB_CTRL_RESET)) != 0 ||
      bk7258_mb_header_state(message) != 0 ||
      (channel & 0xf0u) != 0x40u)
    {
      g_stats.bad_header++;
      state = BK7258_MB_STATE_COM_FAIL;
    }
  else if ((rx_index = rx_channel_index(channel)) < MB_RX_CHANNEL_COUNT &&
           g_rx_callbacks[rx_index] != NULL)
    {
      ret = g_rx_callbacks[rx_index](message, &ack_flags,
                                      g_rx_args[rx_index]);
      if (ret == -EAGAIN)
        {
          if (slot != NULL)
            {
              slot->state = ACK_SLOT_FREE;
            }

          g_stats.deferred_command++;
          return -EAGAIN;
        }
      else if (ret < 0)
        {
          state = BK7258_MB_STATE_COM_FAIL;
        }
    }
  else if (channel == BK7258_MB_CHAN_PWC_RX && g_pwc_rx != NULL)
    {
      ret = g_pwc_rx(message);
      if (ret == -EAGAIN)
        {
          if (slot != NULL)
            {
              slot->state = ACK_SLOT_FREE;
            }

          g_stats.deferred_command++;
          return -EAGAIN;
        }
      else if (ret < 0)
        {
          state = BK7258_MB_STATE_COM_FAIL;
        }
    }
  else if (channel == BK7258_MB_CHAN_SARADC_RX &&
           (bk7258_mb_header_cmd(message) == 0u ||
            bk7258_mb_header_cmd(message) == 1u) &&
           message->payload_address == 1u &&
           message->payload_length == 0u && message->flags == 0u &&
           message->crc8 == 0u && message->reserved == 0u)
    {
      /* Match Armino's SARADC operation-notification ABI. */

      ack_flags = 2u;
      ret = OK;
    }
  else if (channel == BK7258_MB_CHAN_FLASH_RX &&
           (bk7258_mb_header_cmd(message) == FLASH_OP_START ||
            bk7258_mb_header_cmd(message) == FLASH_OP_END) &&
           message->payload_address == FLASH_OP_STATE_REQ)
    {
      /* The CP announces every flash access it is about to make, and its
       * end, on this channel -- for its own writes as much as for anyone
       * else's.  flash_lock() in its flash_driver.c calls
       * mb_flash_op_prepare() with the scheduler already suspended, and
       * send_flash_op_state() then spins until the acknowledgement carries
       * IPC_FLASH_OP_ACK, giving up after FLASH_WAIT_ACK_TIMEOUT (5ms).
       * Its tx-complete ISR only adopts ack_data1 when COM_FAIL is clear,
       * so leaving this channel unmatched does not merely lose the
       * notification: the CP burns that 5ms twice around every flash
       * operation with its tasks suspended.
       *
       * Match the active vendor AP cpu1_pause_handle START/END path.
       * Both cores execute from the same Flash. The vendor path does not
       * park the AP; it pauses registered streaming peripherals then ACKs.
       * This port has no such DMA streams enabled. A future streaming
       * peripheral must implement equivalent pause/resume coordination.
       *
       * Only the header command and param1 are checked.  The CP fills a
       * stack-local mb_chnl_cmd_t and assigns just hdr.data and param1, so
       * param2 and param3 -- payload_length, flags, crc8 and reserved --
       * hold whatever was on its stack.  The SARADC branch above can
       * require them to be zero because its sender clears them; this one
       * must not.
       */

      ack_flags = FLASH_OP_STATE_ACK;
      ret = OK;
    }
  else
    {
      g_stats.unsupported++;
      state = BK7258_MB_STATE_COM_FAIL;
    }

  if ((control & BK7258_MB_CTRL_SYNC_TX) != 0)
    {
      return OK;
    }

  memset(&slot->message, 0, sizeof(slot->message));
  slot->message.header = bk7258_mb_make_ack_header(message,
                                                   state != 0);
  /* On the socket channels the peer reinterprets the whole ack box as the
   * command it sent -- ipc_router_tx_cmpl_isr() in the CP's mb_ipc.c does a
   * plain cast, `ipc_cmd = (mb_ipc_cmd_t *)ack_buf`, and then checks that
   * param1 still matches what it queued (masked with IPC_PARAM1_MASK,
   * 0x00FFFFFF).  So param1 has to be echoed, not replaced by our ack flags.
   *
   * Sending our own value instead made that check fail as "tx2 error @440!
   * 150 != 0": the CP had queued 0x150 and got back 0.  A failed check makes
   * the CP drop the frame without dequeuing it, and the router then takes
   * the
   * link down -- 200 ms after the request, every time.  That also destroys
   * the only way to watch this from the AP, since the console is tunnelled
   * over the same mailbox; the diagnosis had to come from the CP's own log
   * plus its sources.
   *
   * param2 (payload_length and crc8) is echoed for the same reason.  The CP
   * only compares it when built with DEBUG_MB_IPC, but echoing costs nothing
   * and keeps the ack a faithful copy.
   */

  if (channel == BK7258_MB_CHAN_IPC_RX)
    {
      slot->message.payload_address = message->payload_address;
      slot->message.payload_length = message->payload_length;
      slot->message.crc8 = message->crc8;
    }
  else
    {
      slot->message.payload_address = ack_flags;
    }

  /* ack_state as well, not just ack_data1.  mb_chnl_ack_t's third word is
   * the
   * state field (its union names it ack_state), and that is the one the peer
   * tests -- this port's own heartbeat does the same when it checks an ack
   * (bk7258_ipc_heartbeat.c ipc_ack_result() reads ->reserved).  Leaving it
   * zero while answering a command made the CP's mb_ipc socket stay in
   * "receive in process" forever: every later request to its flash server
   * came back with route and api status both RX_BUSY (ack byte 0x52) and no
   * reply.  Callers that pass 0 are unaffected.
   */

  slot->message.reserved = ack_flags;

