open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
  if (ack_slots_used() >= MB_ACK_HIGH_WATER)
    {
      g_probe_requested = true;
    }

  (void)dispatch_locked();
  return OK;
}

static int mailbox_rx(const struct bk7258_mb_wire_message *message)
{
  irqstate_t flags;
  uint8_t control;

  flags = up_irq_save();
  g_stats.rx++;
  control = bk7258_mb_header_ctrl(message);

  if ((control & BK7258_MB_CTRL_RESET) != 0)
    {
      if ((control & BK7258_MB_CTRL_ACK_BOX) == 0 ||
          (bk7258_mb_header_channel(message) & 0xf0u) != 0x40u ||
          (control & ~(BK7258_MB_CTRL_ACK_BOX | BK7258_MB_CTRL_RESET)) != 0)
        {
          g_stats.bad_header++;
        }
      else
        {
          g_stats.resets++;
          g_peer_reset_generation++;
          bk7258_mbox_discard_deferred();
          begin_abort(-ECONNRESET);
        }
    }
  else if ((control & BK7258_MB_CTRL_ACK_BOX) != 0)
    {
      handle_ack(message);
    }
  else
    {
      int ret = handle_command(message);

      if (ret == -EAGAIN)
        {
          up_irq_restore(flags);
          return ret;
        }
    }

  up_irq_restore(flags);
  nxsem_post(&g_tx_sem);
  return OK;
}

static int mailbox_diag_worker(int argc, char **argv)
{
  enum bk7258_mb_link_state reported = BK7258_MB_LINK_QUIESCING;

  (void)argc;
  (void)argv;

  for (; ; )
    {
      nxsem_wait_uninterruptible(&g_diag_sem);
      nxsem_reset(&g_diag_sem, 0);
      irqstate_t flags = up_irq_save();
      enum bk7258_mb_link_state state = g_diag_state;
      bk7258_mb_link_callback_t callback = g_link_callback;
      void *callback_arg = g_link_arg;
      uint32_t timeout = g_stats.timeout;
      uint32_t bad_ack = g_stats.bad_ack;
      uint8_t epoch = g_recovery_index;

      up_irq_restore(flags);
      if (reported == state)
        {
          continue;
        }

      reported = state;
      if (reported != BK7258_MB_LINK_PROBING &&
          reported != BK7258_MB_LINK_READY)
        {
          syslog(LOG_WARNING,
                 "mailbox: link state=%u epoch=%u timeout=%lu bad_ack=%lu\n",
                 reported, epoch, (unsigned long)timeout,
                 (unsigned long)bad_ack);
        }

      if (callback != NULL)
        {
          callback(reported, callback_arg);
        }
    }

  return OK;
}

static int mailbox_tx_worker(int argc, char **argv)
{
  (void)argc;
  (void)argv;

  for (; ; )
    {
      struct active_transaction *probe;
      unsigned int uart_index;
      irqstate_t flags;
      bool request_probe;

      (void)nxsem_tickwait_uninterruptible(&g_tx_sem, MB_WORK_INTERVAL);
      nxsem_reset(&g_tx_sem, 0);
      flags = up_irq_save();

      probe = busy_probe();
      if (probe != NULL &&
          clock_systime_ticks() - probe->started >= MB_TIMEOUT)
        {
          /* A probe going unanswered really does mean the link is down: the
           * probe is the thing that establishes it.  Recovery is right here.
           */

          g_stats.timeout++;
          probe->quarantine = true;
          complete_transaction(probe, NULL, -ETIMEDOUT);
          g_stats.probe_fail++;
          set_link_state(BK7258_MB_LINK_DOWN);
        }
      else if (g_active.busy &&
               clock_systime_ticks() - g_active.started >= MB_TIMEOUT)
        {
          /* An ordinary message going unanswered does not.  Fail that one
           * transaction and carry on.
           *
           * This used to call begin_abort(), which quarantined the link and
           * started a recovery epoch -- and while the link is PROBING,
           * dispatch
           * only lets probe frames out, so the console and the CP heartbeat
           * were both blocked.  The CP's 8-second watchdog then reset the
           * chip.
           * Measured 2026-08-18: one unanswered flash read turned into an
           * endless boot loop ("IPC[1]heartbeat timeout", "Assert at:
           * mb_ipc_task:297"), because the transport treated a single
           * application-level non-reply as evidence that the whole link was
           * broken.  It is not: the console and the heartbeat were working
           * up
           * to that moment, and they are what recovery then destroyed.
           */

          g_stats.timeout++;
          complete_transaction(&g_active, NULL, -ETIMEDOUT);
        }

      if (g_link_state == BK7258_MB_LINK_DOWN &&
          clock_systime_ticks() - g_down_since >= MB_DOWN_RETRY)
        {
          select_recovery_epoch();
        }

      (void)dispatch_locked();
      if (g_probe_requested && ack_slots_used() < MB_ACK_HIGH_WATER)
        {
          g_probe_requested = false;
        }

      uart_index = channel_index(BK7258_MB_CHAN_UART0_TX);
      request_probe = g_probe_requested &&
                      g_link_state == BK7258_MB_LINK_READY &&
                      uart_index < MB_CHANNEL_COUNT &&
                      !g_channels[uart_index].queued && !g_active.busy;
      if (request_probe)
        {
          g_probe_requested = false;
        }

      up_irq_restore(flags);

      if (request_probe)
        {
          bk7258_mb_uart_request_state();
        }
    }

  return OK;
}

int bk7258_mailbox_init(void)
{
  int ret;

  if (g_initialized)
    {
      return OK;
    }

  if (!g_state_initialized)
    {
      memset(g_channels, 0, sizeof(g_channels));
      memset(&g_active, 0, sizeof(g_active));
      memset(g_recovery, 0, sizeof(g_recovery));
      memset(g_ack_slots, 0, sizeof(g_ack_slots));
      memset(&g_stats, 0, sizeof(g_stats));
      g_link_state = BK7258_MB_LINK_DOWN;
      g_diag_state = BK7258_MB_LINK_DOWN;
      g_recovery_index = 0;
      g_probe_attempts = 0;
      g_peer_reset_generation = 0;
      g_uart_tx_failures = 0;
      g_dispatch_rotor = 0;
      nxsem_init(&g_tx_sem, 0, 0);
      nxsem_init(&g_diag_sem, 0, 0);
      g_state_initialized = true;
    }

  if (!g_tx_worker_created)
    {
      ret = kthread_create("mbox-v2", MB_TX_PRIORITY, 2048,
                           mailbox_tx_worker, NULL);
      if (ret < 0)
        {
          return ret;
        }

      g_tx_worker_created = true;
    }

  if (!g_diag_worker_created)
    {
      ret = kthread_create("mbox-diag", 80, 1024,
                           mailbox_diag_worker, NULL);
      if (ret < 0)
        {
          return ret;
        }

      g_diag_worker_created = true;
    }

  g_initialized = true;
  g_physical_started = false;
  return OK;
}

int bk7258_mailbox_start(void)
{
  int ret;

