open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
  if (!g_initialized)
    {
      return -EAGAIN;
    }

  if (g_physical_started)
    {
      return OK;
    }

  bk7258_mbox_set_callback(mailbox_rx);
  ret = bk7258_mbox_init();
  if (ret == OK)
    {
      g_physical_started = true;
    }

  return ret;
}

int bk7258_mailbox_send_wire(uint8_t logical_channel,
                             const struct bk7258_mb_wire_message *message,
                             bk7258_mb_tx_complete_t callback, void *arg)
{
  struct logical_channel *channel;
  unsigned int index;
  irqstate_t flags;

  if (!g_initialized || !g_physical_started || message == NULL)
    {
      return -EAGAIN;
    }

  index = channel_index(logical_channel);
  if (index >= MB_CHANNEL_COUNT)
    {
      return -EINVAL;
    }

  flags = up_irq_save();
  channel = &g_channels[index];

  if (channel->queued)
    {
      up_irq_restore(flags);
      return -EBUSY;
    }

  /* Not READY means not sendable, with one exemption: the UART0 state frame
   * that *is* the probe recovery runs on.
   *
   * The heartbeat is deliberately not exempted here even though it is the
   * one
   * thing the CP's 8 s watchdog measures, because the slot it would have to
   * use (g_active) is quarantined for the duration of a recovery -- the
   * peer's
   * FIFO may still reference it, which is what the quarantine exists to
   * prevent.  Letting it queue instead would be worse than refusing: the
   * caller latches g_heartbeat_pending on a successful submission and would
   * then stop retrying altogether, where -ENOLINK makes it retry every
   * IPC_HEARTBEAT_RETRY until the link is back.
   *
   * So the cost of a recovery that outlasts eight seconds is a chip reset,
   * and
   * the defence is to not enter one for a reason that is not a broken link
   * --
   * see handle_ack(), where a starved console frame used to do exactly that,
   * and dispatch_locked(), where the starvation came from.
   */

  if (g_link_state != BK7258_MB_LINK_READY &&
      !(g_link_state == BK7258_MB_LINK_PROBING &&
        (logical_channel == BK7258_MB_CHAN_UART0_TX &&
         bk7258_mb_header_cmd(message) == BK7258_MB_UART_STATE)) &&
      !is_boot_ready_message(logical_channel, message) &&
      !is_boot_ipc_message(logical_channel, message))
    {
      up_irq_restore(flags);
      return -ENOLINK;
    }

  if (g_link_state == BK7258_MB_LINK_READY && g_active.quarantine)
    {
      up_irq_restore(flags);
      return -ENOLINK;
    }

  memset(&channel->pending, 0, sizeof(channel->pending));
  memcpy(&channel->pending, message, sizeof(channel->pending));
  channel->callback = callback;
  channel->arg = arg;
  channel->result = -EINPROGRESS;
  channel->queued = true;

  (void)dispatch_locked();

  up_irq_restore(flags);

  nxsem_post(&g_tx_sem);
  return OK;
}

int bk7258_mailbox_send_raw(uint8_t logical_channel,
                            const uint8_t frame[BK7258_MB_MESSAGE_SIZE],
                            bk7258_mb_tx_complete_t callback, void *arg)
{
  struct bk7258_mb_wire_message message;

  if (frame == NULL)
    {
      return -EINVAL;
    }

  memcpy(&message, frame, sizeof(message));
  return bk7258_mailbox_send_wire(logical_channel, &message, callback, arg);
}

int bk7258_mailbox_register_rx(uint8_t logical_channel,
                               bk7258_mb_channel_rx_t callback, void *arg)
{
  unsigned int index = rx_channel_index(logical_channel);

  if (index >= MB_RX_CHANNEL_COUNT)
    {
      return -EINVAL;
    }

  g_rx_callbacks[index] = callback;
  g_rx_args[index] = arg;
  return OK;
}

int bk7258_mailbox_start_probe(void)
{
  irqstate_t flags;

  if (!g_initialized)
    {
      return -EAGAIN;
    }

  flags = up_irq_save();
  if (g_link_state == BK7258_MB_LINK_DOWN)
    {
      select_recovery_epoch();
    }

  /* A probe request is idempotent once the transport is ready.  The boot
   * wait loop and the UART worker can request a probe concurrently;
   * reopening
   * a READY link here would abort a valid state ACK and race the first PWC
   * transaction.
   */

  up_irq_restore(flags);
  return OK;
}

void bk7258_mailbox_probe_complete(bool ready)
{
  if (!ready)
    {
      irqstate_t flags = up_irq_save();

      set_link_state(BK7258_MB_LINK_DOWN);
      up_irq_restore(flags);
    }
}

void bk7258_mailbox_force_reset(void)
{
  irqstate_t flags;

  if (!g_initialized)
    {
      return;
    }

  flags = up_irq_save();
  g_stats.resets++;
  begin_abort(-ECONNRESET);
  up_irq_restore(flags);
  nxsem_post(&g_tx_sem);
}

enum bk7258_mb_link_state bk7258_mailbox_link_state(void)
{
  irqstate_t flags = up_irq_save();
  enum bk7258_mb_link_state state = g_link_state;

  up_irq_restore(flags);
  return state;
}

bool bk7258_mailbox_link_ready(void)
{
  return bk7258_mailbox_link_state() == BK7258_MB_LINK_READY;
}

int bk7258_mailbox_wait_link_ready(unsigned int timeout_ms)
{
  clock_t deadline = clock_systime_ticks() + MSEC2TICK(timeout_ms);
  clock_t next_probe = clock_systime_ticks();

  while (!bk7258_mailbox_link_ready())
    {
      clock_t now = clock_systime_ticks();

      if ((int32_t)(clock_systime_ticks() - deadline) >= 0)
        {
          return -ETIMEDOUT;
        }

      /* Keep the boot-time probe self-starting even if the initial
       * ABORTING -> PROBING worker wakeup was consumed before RESET was
       * dispatched.  This only marks STATE pending; normal transaction
       * serialization remains in the mailbox workers.
       */

      if ((int32_t)(now - next_probe) >= 0)
        {
          /* The TX worker can complete STATE between the loop condition and
           * this retry point.  Do not reopen a link that has just become
           * ready.
           */

          if (!bk7258_mailbox_link_ready())
            {
              bk7258_mailbox_start_probe();
              bk7258_mb_uart_request_state();
            }

          next_probe = now + MSEC2TICK(100);
        }

      bk7258_mbox_kick_rx();
      nxsig_usleep(1000);
    }

  return OK;
}

void bk7258_mailbox_set_link_callback(bk7258_mb_link_callback_t callback,
                                      void *arg)
{
  irqstate_t flags = up_irq_save();

