open-vela/nuttx/arch/arm/src/bk7258/bk7258_mailbox_channel.c
  g_link_callback = callback;
  g_link_arg = arg;
  up_irq_restore(flags);
}

uint32_t bk7258_mailbox_peer_reset_generation(void)
{
  irqstate_t flags = up_irq_save();
  uint32_t generation = g_peer_reset_generation;

  up_irq_restore(flags);
  return generation;
}

int bk7258_mbox_send_message(uint8_t command, uint8_t logical_channel,
                             uint32_t param1, uint32_t param2,
                             uint32_t param3)
{
  struct bk7258_mb_wire_message message;
  uint32_t words[4];

  memset(words, 0, sizeof(words));
  words[0] = command;
  words[1] = param1;
  words[2] = param2;
  words[3] = param3;
  memcpy(&message, words, sizeof(message));
  return bk7258_mailbox_send_wire(logical_channel, &message, NULL, NULL);
}

int bk7258_mailbox_send_pwc(uint8_t command, uint32_t p1, uint32_t p2,
                            uint32_t p3)
{
  return bk7258_mbox_send_message(command, BK7258_MB_CHAN_PWC_TX,
                                  p1, p2, p3);
}

void bk7258_mailbox_set_pwc_rx(int (*callback)(const void *message))
{
  g_pwc_rx = callback;
}

static int wait_channel(uint8_t logical_channel, unsigned int timeout_ms)
{
  unsigned int index = channel_index(logical_channel);
  clock_t deadline = clock_systime_ticks() + MSEC2TICK(timeout_ms);

  if (index >= MB_CHANNEL_COUNT)
    {
      return -EINVAL;
    }

  for (; ; )
    {
      irqstate_t flags;
      bool queued;
      int result;

      flags = up_irq_save();
      queued = g_channels[index].queued;
      result = g_channels[index].result;
      up_irq_restore(flags);
      if (!queued)
        {
          return result == -EINPROGRESS ? OK : result;
        }

      if ((int32_t)(clock_systime_ticks() - deadline) >= 0)
        {
          /* HW_CTRL carries the heartbeat.  Printing through the failing
           * transport can block indefinitely before the caller can retry.
           * Its diagnostics are available through a read-only snapshot.
           */

          if (logical_channel != BK7258_MB_CHAN_HW_CTRL_TX)
            {
              bk7258_mailbox_dump_stats();
            }

          return -ETIMEDOUT;
        }

      /* UART link bring-up drains the physical mailbox explicitly because
       * the IRQ may not be dispatched while board_late_initialize() owns the
       * boot transaction.  PWC waits run in the same context and need the
       * same progress guarantee; otherwise CP can process 0x5 and enqueue
       * its
       * ACK while AP remains asleep waiting for an IRQ-side drain.
       */

      bk7258_mbox_kick_rx();
      nxsig_usleep(1000);
    }
}

int bk7258_mailbox_wait_hw_control(unsigned int timeout_ms)
{
  return wait_channel(BK7258_MB_CHAN_HW_CTRL_TX, timeout_ms);
}

int bk7258_mailbox_wait_pwc(unsigned int timeout_ms)
{
  return wait_channel(BK7258_MB_CHAN_PWC_TX, timeout_ms);
}

/****************************************************************************
 * Name: bk7258_mailbox_fill_counters
 *
 * Description:
 *   Same numbers bk7258_mailbox_dump_stats() prints, handed back as data so
 *   that a caller measuring throughput can subtract two snapshots.  It must
 *   not print: the console is one of this transport's own channels, so a
 *   readout that logged would add the traffic it is trying to measure.
 *
 ****************************************************************************/

void bk7258_mailbox_fill_counters(struct bk7258_net_counters *counters)
{
  struct bk7258_mbox_stats physical;

  if (counters == NULL)
    {
      return;
    }

  bk7258_mbox_get_stats(&physical);

  counters->mb_tx              = g_stats.tx;
  counters->mb_rx              = g_stats.rx;
  counters->mb_timeout         = g_stats.timeout;
  counters->mb_fifo_full       = g_stats.fifo_full;
  counters->mb_bad_ack         = g_stats.bad_ack;
  counters->mb_bad_header      = g_stats.bad_header;
  counters->mb_ack_overflow    = g_stats.ack_overflow;
  counters->mb_deferred        = g_stats.deferred_command;
  counters->mb_recovery_cycle  = g_stats.recovery_cycle;
  counters->mb_recovery_replay = g_stats.recovery_replay;
  counters->mb_link_ready      = g_stats.link_ready;
  counters->mb_link_down       = g_stats.link_down;
  counters->mb_link_state      = (uint8_t)g_link_state;
  counters->mb_ack_slots_used  = (uint8_t)ack_slots_used();
  counters->mb_busy            = g_active.busy;

  counters->mb0_rx             = physical.rx_messages;
  counters->mb0_write_full     = physical.write_full;
  counters->mb0_write_error    = physical.write_error;
  counters->mb0_read_error     = physical.read_error;
  counters->mb0_desc_full      = physical.descriptor_full;
  counters->mb0_desc_deferred  = physical.descriptor_deferred;
  counters->mb0_bad_source     = physical.bad_source;
  counters->mb0_bad_length     = physical.bad_length;
  counters->mb0_bad_address    = physical.bad_address;
}

void bk7258_mailbox_dump_stats(void)
{
  struct bk7258_mbox_stats physical;

  bk7258_mbox_get_stats(&physical);
  printf("mailbox: link=%u active=%u/%u tx=%lu rx=%lu timeout=%lu "
         "bad_ack=%lu reason=%08lx bad_header=%lu ack_used=%u fifo_full=%lu "
         "deferred=%lu recovery=%lu/%lu ready=%lu down=%lu\n",
         g_link_state, g_active.busy, busy_probe() != NULL,
         (unsigned long)g_stats.tx, (unsigned long)g_stats.rx,
         (unsigned long)g_stats.timeout, (unsigned long)g_stats.bad_ack,
          (unsigned long)g_stats.bad_ack_reason,
          (unsigned long)g_stats.bad_header, ack_slots_used(),
         (unsigned long)g_stats.fifo_full,
         (unsigned long)g_stats.deferred_command,
         (unsigned long)g_stats.recovery_cycle,
         (unsigned long)g_stats.recovery_replay,
         (unsigned long)g_stats.link_ready,
         (unsigned long)g_stats.link_down);
  printf("mbox0: rx=%lu bad_sid=%lu bad_len=%lu bad_addr=%lu "
         "wrerr=%lu rderr=%lu wrfull=%lu desc_full=%lu deferred=%lu\n",
         (unsigned long)physical.rx_messages,
         (unsigned long)physical.bad_source,
         (unsigned long)physical.bad_length,
         (unsigned long)physical.bad_address,
         (unsigned long)physical.write_error,
         (unsigned long)physical.read_error,
         (unsigned long)physical.write_full,
          (unsigned long)physical.descriptor_full,
          (unsigned long)physical.descriptor_deferred);
  printf("mailbox-last: ack=%08lx active=%08lx cmd=%08lx txerr=%08lx\n",
         (unsigned long)g_stats.last_ack_header,
         (unsigned long)g_stats.last_active_header,
         (unsigned long)g_stats.last_command_header,
         (unsigned long)g_stats.last_tx_error);
  bk7258_mbox_uart_dump_stats();
}
